public class InterfaceTest2 {
	public static void main(String[] args) {
		// TODO 인터페이스 활용 예제
		
		/*
		 * 1. 소리를 키울 때 100이상을 넘지 못하도록 한다.
		 * 2. 소리를 줄일 때 0 미만으로 줄일 수 없도록 한다.
		 * 		(0은 mute 기능으로 처리해도 된다.)
		 * 3. 소리를 키우거나 줄일 때 전원이 켜있을 때만 가능하게 한다.
		 * 
		 * 예시)
		 * 		1. TV
		 * 		2. Radio
		 * 		3. Speaker
		 * 		사용할 제품을 선택하세요 : 1
		 * 
		 * 		TV전원을 켜시겠습니까?(0이나 1을 입력)
		 * 		--- TV전원을 켰을 때 ---
		 * 		1. 소리 증가		2. 소리 감소
		 * 
		 * 		선택 : 1
		 * 		소리 크기 : 20
		 * 		
		 * 		TV소리가 20만큼 증가되었습니다.
		 * 		현재 TV소리크기 : 35
		 * 
		 */
	}
}
